# 1)დაწერეთ პროგრამა, რომელიც ითხოვს მომხმარებლის სახელს და ამის შემდეგ ბეჭდავს: "გამარჯობა, სახელი!" 
name = input("Enter your name: ")
print("Hello",name)

# 2)მომხმარებელს შემოატანინეთ მასზე ინფორმაცია და ეს ყველაფერი ერთ print-ში დაბეჭდეთ
name = input("Enter your name: ")
last_name = input("Enter your last_name: ")
age = input("Enter your age: ")
print(name)
print(last_name)
print(age)
print(name,last_name,age)


#4)and-ის გამოყენებით გააკეთეთ  boolean მაგალითები მაგალითად True and False და ასე შემდეგ კომენტარში ახსენით თუ რატო გამოდის ეგეთი  შედეგი როგორიცაა False
print(True and False) 
print(True and True)
print(False and False)
# პირველ მაგალითში იქნება False. იმიტომ რომ მაგ: ხვალ მე წავალ გარეთ თუ იქნება მზიანი ამინდი და იქნება ოთხშაბათი. 
# გავიღვიძე დილით არის მზიანი ამინდი მაგრამ არ არის ოთხშაბათი დღე, ამიტომ მე გარეთ არ მივდივარ. ამიტომ იქნება False.

#5)იგივე რამ გააკეთეთ ოღონდ უკვე or-ის გამოყენებით მაგალითად True or False და კომენტარში ახსენით თუ რატომ არის საბოლოო პასუხი True და კიდე ბევრი მაგალითი გააკეთეთ კომენტარით ახსენით
print(True or False)
print(True or True)
print(False or False)
# პირველ მაგალითში იქნება True. მოდი მაგალითი მოვიყვანოთ: მე ვთქვი მე წავალ გარეთ თუ ხვალ ოთხშაბათია ან მზიანი ამინდი.
# გავიხედე გარეთ წვიმს მაგრამ დღეს ოთხშაბათია და ამიტომ წავალ გარეთ.

# 6)შეადარეთ რიცხვები ერთმანეთთან გააკეთეთ 5 მაგალითი
print(10 > 5)
print(56 < 17)
print(10 == 10)
print(87 >= 87)
print(67 != 879)
# 7)შემოატანინეთ მოხმარებელს ასაკი და დაბეჭდეთ არის თუ არა მომხმარებლის მიერ შემოტანილი ასაკი 10 ის ტოლი
age = input("Enter your age: ")
print(age == 10)
