'''```1) შექმენით პროგრამა რომელიც temp ცვლადში ინახავს ტემპერატურას (integer, რიცხვით მნიშვნელობას), ხოლო cloudy ცვლადში boolean (True/False) მნიშვენლობას, პროგრამამ უნდა დაადგინოს walk ცვლადის მნიშვენლობა შემდეგი პირობებიდან გამომდინარე, თუ ტემპერატურა მეტია 20 გრადუს ცელსიუზე და ამინი არ არის ღრუბლიანი მხოლოდ მაშინ უნდა გახდეს walk ცვლადის მნიშვნელობა ჭეშმარიტი```'''

# ტემპერატურისა და ამინდის მონაცემები
temp = 25  # ტემპერატურა (integer)
cloudy = False  # ამინდის მდგომარეობა (True - ღრუბლიანი, False - უღრუბლო)

walk = (temp > 20) and cloudy
print(walk)

