'''for ციკლის საშვალებით გამოიტანეთ რიცხვები 20-მდე'''
'''for ციკლის საშვალებით გამოიტანეთ რიცხვები 30-ის ჩათვლით'''
'''for ციკლის საშვალებით გამოიტანეთ რიცხვები 15-იდან 80-მდე'''
'''for ციკლის საშვალებით გამოიტანეთ რიცხვები 0-იდან 43-ჩათვლით'''
'''for ციკლის საშვალებით გამოიტანეთ ყოველი მესამე რიცხვი 0-იდან 50-ჩათვლით'''


for i in range(20):
    print(i)

for i in range(30):
    print(i)

for i in range(15, 80):
    print(i)

for i in range(44):
    print(i)

for i in range(0, 50, 3):
    print(i)

