'''შექმენით ცვლადი რომელშიც შეინახავთ თქვენთვის სასურველ string-ს, უნდა იყოს მინიმუმ 20 სიმბოლო, შემდეგ slicing-ის საშვალებით დაბეჭდეთ ეს string ხუთგვარად შემდეგი პირობებით:
მხოლოდ პირველი 5 სიმბოლო
ბოლო 4 სიმბოლო
შუა ნაწილი მეოთხე სიმბოლოდან მეათემდე
მთელი სტრინგი შებრუნებულად
სტრინგი ამოჭრილი ყოველ მეორე სიმბოლოზე'''

variable = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]
print(variable[:5])
print(variable[16:20])
print(variable[4:11])
print(variable[::-1])
print(variable[::2])

