'''პირველ რიგში დაბეჭდეთ თქვენი სახელი და გვარი, შემდეგ დაბეჭდეთ 3 მათემატიკური ოპერაციის (+,-,*) შედეგი და თქვენი ჰობი, ყველაფერი ახსენით კომენტარებით ქართულად'''


# დავბეჭდოთ ჩემი სახელი და გვარი
name = "Davit"
surname = "Abuladze"
print(name + " " + surname)

#შევკრიბოთ, გამოვაკლოთ და გავამრავლოთ რიცხვები
print(20 + 32)
print(36 - 19)
print(40 * 26)


#დავბეჭდოთ ჩემი ჰობი
hobby = "programing"
print(hobby)


num1 = 20
num2 = 32

num3 = 36
num4 = 19

num5 = 40
num6 = 26
 
print(num1 + num2)
print(num3 - num4)
print(num5 * num6)
