'''შექმენით ცვლადი რომელიც შეინახავს რიცხვს ოღონდ სტრინგად, შემდეგ გადააქციეთ ეს ცვლადი ინტეჯერად და დაუმატეთ თქვენთვის სასურველ რიცხვს'''

'''გააკეთეთ 5 მაგალითი ლოგიკურ ოპერატორებზე , ხოლო 5 მაგალითი შედარების ოპერატორებზე'''

'''კომენტარებით ახსენით არამკაცრი და მკაცრი შედარების ოპერატორები.'''

# 1
num1 = int(str("7"))
num2 = 5
print(num1 + num2)



# 2
# and-ის მაგალითები
print(True and False)
print(True and True)
print(False and False)
print((5 > 3) and (6 > 17))
print((17 > 3) and (588 < 6702))

# or-ის მაგალითები
print(True or False)
print(True or True)
print(False or False)
print((5 > 3) or (6 > 17))
print((687 > 780) or (7892 < 76942))

# 3
# არამკაცრი ოპერატორებია <=, >=
# მკაცრი ოპერატორებია <, >, ==, !=

